# Assignment 1: Introduction to Data Analysis with Pandas

## üìå Overview
In this assignment, you will practice basic **data analysis** using Python, NumPy, and Pandas.
You are provided with a dataset `student_data.csv` that contains information about students, including their **Math scores, Science scores, and Attendance**.

The goal is to get hands-on experience with:
- Loading CSV data into Pandas
- Performing simple statistical analysis
- Filtering and selecting data
- Creating new columns
- Sorting data

This assignment is designed for **beginners** who are just starting with Python for data science.

---

## üìä Dataset Description
The dataset contains the following columns:

- **StudentID** ‚Üí Unique ID for each student
- **Name** ‚Üí Student‚Äôs name
- **Age** ‚Üí Student‚Äôs age
- **Math_Score** ‚Üí Score in Math (out of 100)
- **Science_Score** ‚Üí Score in Science (out of 100)
- **Attendance** ‚Üí Attendance percentage

---

## üìù Tasks

### Task 1: Load and Inspect Data
- Load the CSV file using Pandas.
- Display the first 5 rows of the dataset.

---

### Task 2: Basic Statistics
- Find the **average Math score** and **average Science score**.
- Find the **maximum attendance**.

---

### Task 3: Filtering Data
- Select all students who scored **more than 80 in Math**.
- Select all students with **attendance below 70**.

---

### Task 4: Creating a New Column
- Create a new column called **`Average_Score`** = (Math_Score + Science_Score) / 2.
- Display the dataset with this new column.

---

### Task 5: Sorting Data
- Sort the dataset by `Average_Score` in **descending order**.
- Display the **top 3 students**.

---

## ‚úÖ Submission
- Save your completed work in a Jupyter Notebook (`.ipynb`).
- Make sure each task is clearly labeled with headings.
- Upload your notebook once finished.

Good luck üéâ and have fun exploring your first dataset!


# Assignment 1 ‚Äî Solution: Introduction to Data Analysis with Pandas

In [7]:
#Installing Libraries
!pip install pandas numpy

In [8]:
#Importing Libraries
import pandas as pd
import numpy as np

## Task 1

In [10]:
#Loading the data
df = pd.read_csv('student_data.csv')

In [11]:
#Displaying the first 5 row
df.head()

   StudentID     Name  Age  Math_Score  Science_Score  Attendance
0          1    Alice   20          85             80          90
1          2      Bob   21          67             70          75
2          3  Charlie   19          90             85          95
3          4    David   22          45             50          60
4          5      Eva   20          78             76          85

## Task 2

In [14]:
math_ave = df['Math_Score'].mean()
sci_ave = df['Science_Score'].mean()
max_attendance = df['Attendance'].max()

In [16]:
print(math_ave)
print(sci_ave)
print(max_attendance)

73.2
73.6
98

## Task 3

In [17]:
higherScored_studentMath = df[df['Math_Score']>80]
lowAttendance_student = df[df['Attendance']<70]
higherScored_studentMath, lowAttendance_student

(   StudentID     Name  Age  Math_Score  Science_Score  Attendance
 0          1    Alice   20          85             80          90
 2          3  Charlie   19          90             85          95
 5          6    Frank   23          88             90          92
 7          8    Helen   19          92             88          98,
    StudentID   Name  Age  Math_Score  Science_Score  Attendance
 3          4  David   22          45             50          60
 9         10   Jack   20          60             65          68)

## Task 4

In [18]:
df = df.copy()
df['Average_Score'] = (df['Math_Score']+df['Science_Score'])/2
df.head()

,StudentID,Name,Age,Math_Score,Science_Score,Attendance,Average_Score
0,1,Alice,20,85,80,90,82.5
1,2,Bob,21,67,70,75,68.5
2,3,Charlie,19,90,85,95,87.5
3,4,David,22,45,50,60,47.5
4,5,Eva,20,78,76,85,77.0

## Task 5

In [20]:
top = df.sort_values(by="Average_Score", ascending=False)

In [21]:
top

,StudentID,Name,Age,Math_Score,Science_Score,Attendance,Average_Score
7,8,Helen,19,92,88,98,90.0
5,6,Frank,23,88,90,92,89.0
2,3,Charlie,19,90,85,95,87.5
0,1,Alice,20,85,80,90,82.5
4,5,Eva,20,78,76,85,77.0
8,9,Ian,22,71,72,80,71.5
1,2,Bob,21,67,70,75,68.5
9,10,Jack,20,60,65,68,62.5
6,7,Grace,21,56,60,70,58.0
3,4,David,22,45,50,60,47.5

In [22]:
top.head(3)

,StudentID,Name,Age,Math_Score,Science_Score,Attendance,Average_Score
7,8,Helen,19,92,88,98,90.0
5,6,Frank,23,88,90,92,89.0
2,3,Charlie,19,90,85,95,87.5